// Вариант 10, задание 1:
// Дан файл f. Создать два файла, записав в 
// первый из них среднее геометрическое всех четных чисел, а во второй – среднее арифметическое всех нечетных чисел.

// Вариант 10, задание 2:
//Сформировать массив на диске, содержащий сведения об ассортименте игрушек в магазине.
//Структурный тип содержит поля : название игрушки, цена, количество, возрастные границы(2 - 5).
//Написать программу, которая выбирает необходимую информацию с диска и выводит на экран :
//-название игрушек, которые подходят детям от 1 до 3 лет;
//-стоимость самой дорогой игрушки и ее название;
//-название игрушки, которая по стоимости не превышает X руб.и подходит ребенку в возрасте от A до B лет.
//Значения A, B, X вводятся с клавиатуры.

#include <iostream>
using namespace std;

int main()
{

}
